In [1]:
import pandas as pd
import numpy as np
from sklearn import preprocessing
from sklearn.preprocessing import MinMaxScaler

In [ ]:
# 1. Create a Datatime index containing all the weekdays days of year 2019 and assign a random number to each of them 
# in a dataframe.

In [62]:
s = pd.date_range('2019-01-01', periods = 365, freq='D').to_series()

print("Datetime Index : \n ", s.dt.weekday)

Datetime Index :
  2019-01-01    1
2019-01-02    2
2019-01-03    3
2019-01-04    4
2019-01-05    5
             ..
2019-12-27    4
2019-12-28    5
2019-12-29    6
2019-12-30    0
2019-12-31    1
Freq: D, Length: 365, dtype: int64

In [63]:

from datetime import datetime, timedelta

days = pd.date_range('2019-01-01',periods = 365, freq='D').to_series()
print(days)
np.random.seed(seed=100)
data = np.random.randint(1, high=365, size=len(days))
df = pd.DataFrame({'Date': days, 'Index': data})
# df = df.set_index('test')
df.head(20)

2019-01-01   2019-01-01
2019-01-02   2019-01-02
2019-01-03   2019-01-03
2019-01-04   2019-01-04
2019-01-05   2019-01-05
                ...
2019-12-27   2019-12-27
2019-12-28   2019-12-28
2019-12-29   2019-12-29
2019-12-30   2019-12-30
2019-12-31   2019-12-31
Freq: D, Length: 365, dtype: datetime64[ns]

                 Date  Index
2019-01-01 2019-01-01      9
2019-01-02 2019-01-02    281
2019-01-03 2019-01-03    324
2019-01-04 2019-01-04    360
2019-01-05 2019-01-05    344
2019-01-06 2019-01-06     80
2019-01-07 2019-01-07    351
2019-01-08 2019-01-08    355
2019-01-09 2019-01-09     54
2019-01-10 2019-01-10     67
2019-01-11 2019-01-11    227
2019-01-12 2019-01-12     15
2019-01-13 2019-01-13    291
2019-01-14 2019-01-14    241
2019-01-15 2019-01-15    281
2019-01-16 2019-01-16    144
2019-01-17 2019-01-17    229
2019-01-18 2019-01-18    364
2019-01-19 2019-01-19    317
2019-01-20 2019-01-20     59

In [64]:
idx = pd.date_range('2019-01-01', periods=365, freq='D')

ts = pd.Series(range(len(idx)), index=idx)

df = pd.DataFrame({'Date': ts})
# df = df.set_index('test')
df.head(20)

            Date
2019-01-01     0
2019-01-02     1
2019-01-03     2
2019-01-04     3
2019-01-05     4
2019-01-06     5
2019-01-07     6
2019-01-08     7
2019-01-09     8
2019-01-10     9
2019-01-11    10
2019-01-12    11
2019-01-13    12
2019-01-14    13
2019-01-15    14
2019-01-16    15
2019-01-17    16
2019-01-18    17
2019-01-19    18
2019-01-20    19

In [ ]:
# 2. Given Pandas series , height = [23,42,55] and weight = [71,32,48] . 
# Create a dataframe with height and weight as column names.

In [65]:
data = {'height' : [23,42,55] , 'weight' : [71,32,48]}

df = pd.DataFrame(data)

df.head(10)

   height  weight
0      23      71
1      42      32
2      55      48

In [ ]:
# 3. How to get the items of series A not present in series B .From ser1 remove items present in bser2.

In [66]:
ser1 = pd.Series([2,3,4,5])
ser2 = pd.Series([5,6,7,8])

In [67]:
print("\nOriginal Series of ser1, ser2 : \n", ser1,"\n",ser2)

print("\nitems of series A not present in series B are :")
result = ser1[~ser1.isin(ser2)]
print(result)

Original Series of ser1, ser2 :
 0    2
1    3
2    4
3    5
dtype: int64
 0    5
1    6
2    7
3    8
dtype: int64

items of series A not present in series B are :
0    2
1    3
2    4
dtype: int64

In [ ]:
# Questions on Titanic Dataset :-

In [68]:
ti_df = pd.read_csv(r'E:\End to End DS - Supervised Learning\Data Source\titanic.csv')

In [ ]:
# 4. Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset

In [ ]:
ti_df.head()

In [69]:
num_state = np.random.RandomState(100)
Age = pd.notnull(ti_df["Age"])
Age_list = ti_df[Age]
Age_list_new = Age_list["Age"]
print("Original Series:")
print(Age_list_new)
result = np.percentile(Age_list_new, q=[0, 25, 50, 75, 100])
print("\nMinimum, 25th percentile, median, 75th, and maximum of a given series:")
print(result)

Original Series:
0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 714, dtype: float64

Minimum, 25th percentile, median, 75th, and maximum of a given series:
[ 0.42  20.125 28.    38.    80.   ]

In [70]:
# Just for my reference to validate the result

Age_list["Age"].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [ ]:
# 5. How to get frequency counts of unique items of a series?
# Calculate the frequency counts of ‘SibSp’ column in titanic Dataset

In [ ]:
# Using value_counts() function  - frequency counts of unique items of a series can be found

In [71]:
SibSp_col = ti_df["SibSp"]
print("Original Series in ‘SibSp’ column:")
print(SibSp_col)
print("frequency counts of unique values in ‘SibSp’ column")
result = SibSp_col.value_counts()
print(result)

Original Series in ‘SibSp’ column:
0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    1
889    0
890    0
Name: SibSp, Length: 891, dtype: int64
frequency counts of unique values in ‘SibSp’ column
0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [ ]:
# 6. Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset

In [ ]:
ti_df

In [72]:
print("Top 2 Freq. in Embarked Field :")
Embarked_colval = ti_df["Embarked"]
#print(Embarked_colval)
Embarked_colval_freq = ti_df["Embarked"].value_counts()
print(Embarked_colval_freq)

print("Keep Top 2 Freq. and replace rest as Other :")
print(Embarked_colval.isin(Embarked_colval_freq.index[:2]))
result = Embarked_colval[~Embarked_colval.isin(Embarked_colval_freq.index[:2])] = 'Other'
print(Embarked_colval)

Top 2 Freq. in Embarked Field :
S    644
C    168
Q     77
Name: Embarked, dtype: int64
Keep Top 2 Freq. and replace rest as Other :
0       True
1       True
2       True
3       True
4       True
       ...
886     True
887     True
888     True
889     True
890    False
Name: Embarked, Length: 891, dtype: bool
0          S
1          C
2          S
3          S
4          S
       ...
886        S
887        S
888        S
889        C
890    Other
Name: Embarked, Length: 891, dtype: object

C:\Users\pinku\Anaconda3\lib\site-packages\ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

In [ ]:
# 7.  Bin the Fare column in titanic data set into 5 equal groups and get counts of each bin

In [76]:
ti_df['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [78]:
ti_df['Fare'].value_counts(bins=5)

(-0.513, 102.466]     838
(102.466, 204.932]     33
(204.932, 307.398]     17
(409.863, 512.329]      3
(307.398, 409.863]      0
Name: Fare, dtype: int64

In [ ]:
# 8. Count the number of missing values in each column?

In [81]:
print(" \nCount the number of missing values in each column? : \n\n\n",ti_df.isnull().sum())

Count the number of missing values in each column? :


 PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [ ]:
# 9. Get the row number of the 5th largest value in the Age column of titanic dataset?

In [82]:
# five largest values in column age 
ti_df.nlargest(5, ['Age'])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Other

In [93]:
# This gives row number of Max value in Age Column
ti_df['Age'].idxmax()

630

In [ ]:
# 10. Normalize all columns in a dataframe?

In [98]:
ti_df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
414,415,1,3,"Sundman, Mr. Johan Julian",male,44.0,0,0,STON/O 2. 3101269,7.9250,NaN,S
495,496,0,3,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C
830,831,1,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
557,558,0,1,"Robbins, Mr. Victor",male,NaN,0,0,PC 17757,227.5250,NaN,C

In [121]:
min_max_scaler = preprocessing.MinMaxScaler()

column_names_to_normalize = ['PassengerId', 'Survived', 'Pclass','Age','SibSp','Parch','Fare']

x = ti_df[column_names_to_normalize].values

x_scaled = min_max_scaler.fit_transform(x)

df_temp = pd.DataFrame(x_scaled, columns=column_names_to_normalize, index = ti_df.index)

ti_df[column_names_to_normalize] = df_temp

df_temp.sample(10)

     PassengerId  Survived  Pclass       Age  SibSp     Parch      Fare
640     0.719101       0.0     1.0  0.246042  0.000  0.000000  0.015330
807     0.906742       0.0     1.0  0.220910  0.000  0.000000  0.015176
559     0.628090       1.0     1.0  0.447097  0.125  0.000000  0.033963
633     0.711236       0.0     0.0       NaN  0.000  0.000000  0.000000
242     0.271910       0.0     0.5  0.359135  0.000  0.000000  0.020495
131     0.147191       0.0     1.0  0.246042  0.000  0.000000  0.013761
331     0.371910       0.0     0.0  0.566474  0.000  0.000000  0.055628
644     0.723596       1.0     1.0  0.004147  0.250  0.166667  0.037590
664     0.746067       1.0     1.0  0.246042  0.125  0.000000  0.015469
840     0.943820       0.0     1.0  0.246042  0.000  0.000000  0.015469

In [ ]:
# 11. Get the indices of items of ser2 in ser1 as a list.

In [122]:
ser1 = pd.Series([10,9,6,5,3,1,12,8,13])
ser2 = pd.Series([1,3,10,13])

In [125]:
#series1 = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
#series2 = pd.Series([1, 3, 5, 7, 10])
ser1 = pd.Series([10,9,6,5,3,1,12,8,13])
ser2 = pd.Series([1,3,10,13])
print("Original Series:")
print(ser1)
print(ser2)
result = [pd.Index(ser1).get_loc(i) for i in ser2]
print("Positions of items of ser2 in ser1:")
print(result)

Original Series:
0    10
1     9
2     6
3     5
4     3
5     1
6    12
7     8
8    13
dtype: int64
0     1
1     3
2    10
3    13
dtype: int64
Positions of items of series2 in series1:
[5, 4, 0, 8]

In [ ]:
# 12. How to convert a series of date-strings to a timeseries?

In [ ]:
# ['01 Jan 2010', '02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20']

In [126]:
#date_series = pd.Series(['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20'])
date_series = pd.Series(['01 Jan 2010', '02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])
print("Original Series:")
print(date_series)
print("\nSeries of date strings to a timeseries:")
print(pd.to_datetime(date_series))

Original Series:
0         01 Jan 2010
1          02-02-2011
2            20120303
3          2013/04/04
4          2014-05-05
5    2015-06-06T12:20
dtype: object

Series of date strings to a timeseries:
0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [ ]:
# 13. Get the day of month, week number, day of year and day of week from ser.

In [ ]:
ser = pd.Series(['01 Jan 2010', '02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])

In [128]:
from dateutil.parser import parse

date_series = pd.Series(['01 Jan 2010', '02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])
print("Original Series:")
print(date_series)
date_series = date_series.map(lambda x: parse(x))

print("Day of month:")
print(date_series.dt.day.tolist())

print("Week number:")
print(date_series.dt.weekofyear.tolist())

print("Day of year:")
print(date_series.dt.dayofyear.tolist())

print("Day of week:")
print(date_series.dt.weekday_name.tolist())

Original Series:
0         01 Jan 2010
1          02-02-2011
2            20120303
3          2013/04/04
4          2014-05-05
5    2015-06-06T12:20
dtype: object
Day of month:
[1, 2, 3, 4, 5, 6]
Week number:
[53, 5, 9, 14, 19, 23]
Day of year:
[1, 33, 63, 94, 125, 157]
Day of week:
['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

In [ ]:
# 14. Compute the euclidean distance between series (points) p and q, without using a packaged formula.
# p = pd.Series([1,2,3,4,5,6,7,8,9,10])
# q = pd.Series([10,9,8,7,6,5,4,3,2,1])

In [10]:
import math
p = pd.Series([1,2,3,4,5,6,7,8,9,10])
q = pd.Series([10,9,8,7,6,5,4,3,2,1])

print("\neuclidean distance between series (points) p and q is : \n")
distance = math.sqrt(((p[0]-q[0])**2) + ((p[1]-q[1])**2) + ((p[2]-q[2])**2) + ((p[3]-q[3])**2) 
                     + ((p[4]-q[4])**2) + ((p[5]-q[5])**2) + ((p[6]-q[6])**2) + ((p[7]-q[7])**2)
                     + ((p[8]-q[8])**2) + ((p[9]-q[9])**2)
                    )
print(distance)

euclidean distance between series (points) p and q is :

18.16590212458495

In [ ]:
# 15. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)

In [15]:
ser = pd.Series(np.random.randint(1,10,10), pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
ser

2000-01-01    6
2000-01-08    3
2000-01-15    5
2000-01-22    3
2000-01-29    2
2000-02-05    2
2000-02-12    7
2000-02-19    6
2000-02-26    2
2000-03-04    4
Freq: W-SAT, dtype: int32

In [ ]:
# 16. Import every 50th row of BostonHousing dataset as a dataframe.

In [16]:
bos_pd = pd.read_csv(r'E:\End to End DS - Supervised Learning\Data Source\boston_house_price.csv')

In [22]:
pip install datatable

Requirement already satisfied: datatable in c:\users\pinku\anaconda3\lib\site-packages (0.11.0)
Note: you may need to restart the kernel to use updated packages.

In [34]:
import datatable as dt
import csv

with open('E:/End to End DS - Supervised Learning/Data Source/boston_house_price.csv', 'r') as f:
    reader = csv.reader(f)
    for i, row in enumerate(reader):
        row = [[x] for x in row]
        # 1st row
        if i == 0:  
            df = dt.Frame(row)
            header = [x[0] for x in df[0,:].to_list()]
            df.names =  header
            del df[0,:]  
        # Every 50th row
        elif i%50 ==0:
            df_temp = dt.Frame(row)
            df_temp.names = header
            df.rbind(df_temp)

df.head(5)